export default {
  subject: 'high-korean',
  level: 'high',
  annexId: 'kr-moe-2022-33-annex5',
  highRequired: [
    ['12주탐01-02', '12주탐01-04', '주제 탐구 독서', 149],
    ['12언탐01-01', '12언탐01-02', '언어생활 탐구', 206],
  ],
  highCommentaryRequired: [
    ['10공국1-04-02', '10공국2-04-02', 95, '공통국어1의 음운 변동 지식을 고교 맞춤법 원리 적용과 연계해 심화한다.'],
    ['12주탐01-04', '12주탐01-05', 151, '선정·분석한 정보를 종합해 주제에 대한 관점과 견해를 형성한다.'],
    ['12직의01-03', '12직의01-04', 173, '직무 정보에 대한 이해를 바탕으로 정보를 안전하고 체계적으로 관리한다.'],
    ['12독토01-01', '12독토01-02', 186, '독서 중 생성한 질문을 독서 토론의 주제로 활용한다.'],
    ['12독토01-02', '12독토01-03', 187, '독서 토론을 마친 뒤 그 내용을 활용해 글을 쓰고 공유한다.'],
    ['12언탐01-02', '12언탐01-07', 209, '자료 평가·해석 결과를 토대로 언어생활을 성찰하고 바람직한 언어문화를 실천한다.'],
  ],
  middleRequired: [],
  middleCommentaryRequired: [],
  elementaryToMiddleRequired: [],
  elementaryCommentaryRequired: [],
  middleToHighRequired: [],
}
